{
  "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
  "contentVersion": "1.0.0.0",
  "parameters": {
    "workspaceName": {
      "type": "string",
      "metadata": {
        "description": "Name of the Log Analytics workspace"
      }
    },
    "workspaceResourceId": {
      "type": "string",
      "metadata": {
        "description": "Full resource ID of the Log Analytics workspace"
      }
    }
  },
  "resources": [
    {
      "type": "Microsoft.Insights/scheduledQueryRules",
      "apiVersion": "2023-03-15-preview",
      "name": "Password Spray Attack Detection",
      "location": "[resourceGroup().location]",
      "properties": {
        "displayName": "Password Spray Attack Detection",
        "description": "Detects password spray attacks based on high volume of failed login attempts across multiple accounts",
        "severity": 2,
        "enabled": true,
        "evaluationFrequency": "PT5M",
        "scopes": [
          "[parameters('workspaceResourceId')]"
        ],
        "targetResourceTypes": [
          "Microsoft.OperationalInsights/workspaces"
        ],
        "windowSize": "PT1H",
        "overrideQueryTimeRange": "PT2H",
        "criteria": {
          "allOf": [
            {
              "query": "SigninLogs\n| where ResultType == \"50126\"\n| summarize FailedCount = count(), TargetAccounts = dcount(UserPrincipalName) by IPAddress, bin(TimeGenerated, 10m)\n| where TargetAccounts > 10",
              "timeAggregation": "Count",
              "dimensions": [
                {
                  "name": "IPAddress",
                  "operator": "Include",
                  "values": ["*"]
                }
              ],
              "operator": "GreaterThan",
              "threshold": 10,
              "failingPeriods": {
                "numberOfEvaluationPeriods": 1,
                "minFailingPeriodsToAlert": 1
              }
            }
          ]
        },
        "autoMitigate": false,
        "actions": {
          "actionGroups": [],
          "customProperties": {}
        }
      }
    }
  ]
}
